app/controllers/dashboard_controller.rb

  def index
    @links = current_user.links.order(created_at: :desc)
---
SELECT "links".* FROM "links" WHERE "links"."user_id" = 1 ORDER BY "links"."created_at" DESC