app/controllers/links_controller.rb

INSERT INTO "links" ("original_url", "code", "cta_text", "cta_link", "cta_button_text", "cta_position", "cta_color", "created_at", "updated_at", "user_id", "expires_at", "click_count") VALUES ('https://v.daum.net/v/20251003173112430', 'BOPAnB', '확인해보세요!', 'https://www.google.com/', '자세히 보기', 'center', '#2563eb', '2025-10-15 11:05:09.162773', '2025-10-15 11:05:09.162773', NULL, '2025-10-16 11:05:09.174668', 0) RETURNING "id"
---
  def create
    @link = Link.new(link_params)

    # 로그인 사용자인 경우 user 연결
    @link.user = current_user if user_signed_in?

    if @link.save

SELECT "links".* FROM "links" WHERE "links"."code" = 'favicon' LIMIT 1
UPDATE "links" SET "click_count" = COALESCE("click_count", 0) + 1 WHERE "links"."id" = 1
---
  def show
    @link = Link.find_by!(code: params[:code] || params[:id])

    if @link.expired?
      render :expired, layout: false
    else
      @link.increment_clicks!